Revit 2027 API
Glazing.GlazingTransmittanceColor Property
 The property labeled "Color" from the "Glazing" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GlazingTransmittanceColor { get; }
Public Shared ReadOnly Property GlazingTransmittanceColor As String
	Get
public:
static property String^ GlazingTransmittanceColor {
	String^ get ();
}
static member GlazingTransmittanceColor : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "GlazingTransmittanceColorType".
See Also
Reference
Glazing Class
Autodesk.Revit.DB.Visual Namespace